tutorials/incompressible/pimpleHFDIBFoam/2D_Sphere-Sphere-Wall/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (-1.5 -5 -0.05) //0
    (1.5 -5 -0.05) //1
    (1.5 5 -0.05) //2
    (-1.5 5 -0.05) //3
    (-1.5 -5 0.05) //0
    (1.5 -5 0.05) //1
    (1.5  5 0.05) //2
    (-1.5 5 0.05) //3
);

blocks
(
    hex (0 1 2 3 4 5 6 7) Randomizer (30 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
			(0 4 7 3)	
            (2 6 5 1)
            (1 5 4 0)            
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
         );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
