tutorials/incompressible/pimpleHFDIBFoam/2D_Sphere-Sphere-Wall/constant/g
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    location    "constant";
    object      g;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];
// value           (0 -9.81 0);
//~ value           (0 -5.00 0);
value           (0 0  0 );	
//~ value           (6.94 0  -6.94 );
//~ value           (5.0 0  -5.0 );


// ************************************************************************* //
